================================================================================
ASSIGN basic
================================================================================

ASSIGN a = 1.
ASSIGN x = "hello".
ASSIGN flag = TRUE.

--------------------------------------------------------------------------------

(source_code
  (assign_statement
    (assign_pair
      left: (identifier)
      right: (number_literal)))
  (assign_statement
    (assign_pair
      left: (identifier)
      right: (string_literal)))
  (assign_statement
    (assign_pair
      left: (identifier)
      right: (boolean_literal))))

================================================================================
ASSIGN multiple pairs
================================================================================

ASSIGN
  a = 1
  b = "x"
  c = TRUE
  d = 3.14.

--------------------------------------------------------------------------------

(source_code
  (assign_statement
    (assign_pair
      left: (identifier)
      right: (number_literal))
    (assign_pair
      left: (identifier)
      right: (string_literal))
    (assign_pair
      left: (identifier)
      right: (boolean_literal))
    (assign_pair
      left: (identifier)
      right: (number_literal))))

================================================================================
ASSIGN with WHEN AVAILABLE clause
================================================================================

ASSIGN
  a = 1
  b = "x" WHEN AVAILABLE Customer
  c = Customer.Name WHEN AVAILABLE Customer.

--------------------------------------------------------------------------------

(source_code
  (assign_statement
    (assign_pair
      left: (identifier)
      right: (number_literal))
    (assign_pair
      left: (identifier)
      right: (string_literal)
      (when_available_phrase
        (identifier)))
    (assign_pair
      left: (identifier)
      right: (qualified_name
        left: (identifier)
        right: (identifier))
      (when_available_phrase
        (identifier)))))

================================================================================
ASSIGN with NO-ERROR
================================================================================

ASSIGN amount = DECIMAL(par_amount) NO-ERROR.
ASSIGN a = 1 b = 2 NO-ERROR.

--------------------------------------------------------------------------------

(source_code
  (assign_statement
    (assign_pair
      left: (identifier)
      right: (function_call
        function: (identifier)
        (arguments
          (argument
            value: (identifier)))))
    (no_error))
  (assign_statement
    (assign_pair
      left: (identifier)
      right: (number_literal))
    (assign_pair
      left: (identifier)
      right: (number_literal))
    (no_error)))

================================================================================
ASSIGN with comment
================================================================================

ASSIGN // note
  a = 1
  b = "x".

--------------------------------------------------------------------------------

(source_code
  (assign_statement
    (comment
      (line_comment))
    (assign_pair
      left: (identifier)
      right: (number_literal))
    (assign_pair
      left: (identifier)
      right: (string_literal))))

================================================================================
ASSIGN with dataset reference
================================================================================

ASSIGN c = dataset BDebtorShipTo:handle.

--------------------------------------------------------------------------------

(source_code
  (assign_statement
    (assign_pair
      left: (identifier)
      right: (dataset_reference
        dataset: (object_access
          left: (identifier)
          right: (identifier))))))

================================================================================
ASSIGN with conditional expression
================================================================================

ASSIGN status = IF ok THEN "Y" ELSE "N".

--------------------------------------------------------------------------------

(source_code
  (assign_statement
    (assign_pair
      left: (identifier)
      right: (conditional_expression
        (identifier)
        (string_literal)
        (string_literal)))))

================================================================================
ASSIGN with qualified names
================================================================================

ASSIGN Customer.Name = "John"
       Customer.Balance = 100.00.

--------------------------------------------------------------------------------

(source_code
  (assign_statement
    (assign_pair
      left: (qualified_name
        left: (identifier)
        right: (identifier))
      right: (string_literal))
    (assign_pair
      left: (qualified_name
        left: (identifier)
        right: (identifier))
      right: (number_literal))))

================================================================================
Simple assignment statement
================================================================================

x = 1.
Customer.Name = "test".
a = b + c.

--------------------------------------------------------------------------------

(source_code
  (assignment_statement
    left: (identifier)
    operator: (assignment_operator)
    right: (number_literal))
  (assignment_statement
    left: (qualified_name
      left: (identifier)
      right: (identifier))
    operator: (assignment_operator)
    right: (string_literal))
  (assignment_statement
    left: (identifier)
    operator: (assignment_operator)
    right: (binary_expression
      (identifier)
      (identifier))))

================================================================================
Assignment with NO-ERROR
================================================================================

x = 1 NO-ERROR.

--------------------------------------------------------------------------------

(source_code
  (assignment_statement
    left: (identifier)
    operator: (assignment_operator)
    right: (number_literal)
    (no_error)))

================================================================================
Assignment to function result
================================================================================

PUT-STRING(workBuf, 1) = cmdValue.

--------------------------------------------------------------------------------

(source_code
  (assignment_statement
    left: (function_call
      function: (identifier)
      (arguments
        (argument
          value: (identifier))
        (argument
          value: (number_literal))))
    operator: (assignment_operator)
    right: (identifier)))

================================================================================
Expression statement with NO-ERROR
================================================================================

doWork() NO-ERROR.

--------------------------------------------------------------------------------

(source_code
  (expression_statement
    (function_call
      function: (identifier)
      (arguments))
    (no_error)))

================================================================================
Assignment with INPUT, IN FRAME, and string options
================================================================================

baz = INPUT FRAME y bar.
quux = INPUT qux.
x = qbf-s:SCREEN-VALUE IN FRAME qbf-area.
a = "A":U.
b = "Hello":R10.
c = "Trim":T.

--------------------------------------------------------------------------------

(source_code
  (assignment_statement
    left: (identifier)
    operator: (assignment_operator)
    right: (input_expression
      frame: (identifier)
      field: (identifier)))
  (assignment_statement
    left: (identifier)
    operator: (assignment_operator)
    right: (input_expression
      field: (identifier)))
  (assignment_statement
    left: (identifier)
    operator: (assignment_operator)
    right: (in_frame_expression
      value: (object_access
        left: (identifier)
        right: (identifier))
      frame: (identifier)))
  (assignment_statement
    left: (identifier)
    operator: (assignment_operator)
    right: (string_literal))
  (assignment_statement
    left: (identifier)
    operator: (assignment_operator)
    right: (string_literal))
  (assignment_statement
    left: (identifier)
    operator: (assignment_operator)
    right: (string_literal)))
