===============================================================================
UNLOAD statement
===============================================================================

UNLOAD "myfile.r".
UNLOAD cFile.

--------------------------------------------------------------------------------

(source_code
  (unload_statement
    file: (string_literal))
  (unload_statement
    file: (identifier)))

===============================================================================
UNLOAD statement with NO-ERROR
===============================================================================

UNLOAD "myfile.r" NO-ERROR.
UNLOAD cFile NO-ERROR.

--------------------------------------------------------------------------------

(source_code
  (unload_statement
    file: (string_literal))
  (unload_statement
    file: (identifier)))

===============================================================================
UNLOAD statement with different expression types
===============================================================================

UNLOAD "path/to/file.r".
UNLOAD cFilePath.
UNLOAD cPathVariable + ".r".

--------------------------------------------------------------------------------

(source_code
  (unload_statement
    file: (string_literal))
  (unload_statement
    file: (identifier))
  (unload_statement
    file: (binary_expression
      (identifier)
      (string_literal))))

===============================================================================
UNLOAD - VALUE expression
===============================================================================

UNLOAD VALUE(cFile) NO-ERROR.

-------------------------------------------------------------------------------

(source_code
  (unload_statement
    file: (function_call
      function: (identifier)
      (arguments
        (argument
          name: (identifier))))))
